import sys
input = sys.stdin.readline
N, M = map(int, input().split())
numbers = [list(map(int, input().split())) for _ in range(N)]
tetromino = [
            [(0,0),(0,1),(0,2),(0,3)],
            [(0,0),(1,0),(2,0),(3,0)],
            # ㅁ
            [(0,0),(0,1),(1,0),(1,1)],
            # ㄴ
            [(0,0),(1,0),(2,0),(2,1)],
            [(0,0),(0,1),(0,2),(1,0)], 
            [(0,0),(0,1),(1,1),(2,1)], 
            [(0,2),(1,0),(1,1),(1,2)],
            [(0,0),(1,0),(1,1),(1,2)],
            [(0,0),(0,1),(1,0),(2,0)],
            [(0,0),(0,1),(0,2),(1,2)],
            [(0,1),(1,1),(2,0),(2,1)],
            
            [(0,0),(0,1),(1,1),(1,2)],
            [(0,1),(1,0),(1,1),(2,0)],
            [(0,0),(1,0),(1,1),(2,1)],
            [(0,1),(0,2),(1,0),(1,1)],
            # ㅗ
            [(0,0),(0,1),(0,2),(1,1)],
            [(0,1),(1,0),(1,1),(2,1)],
            [(0,1),(1,0),(1,1),(1,2)],
            [(0,0),(1,0),(1,1),(2,0)],
]
result = 0
for i in range(N):
    for j in range(M):
        for t in tetromino:
            total = 0
  
            for dx, dy in t:
                nx, ny = i + dx, j + dy
                if 0 <= nx < N and 0 <= ny < M:
                    total += numbers[nx][ny]
                    continue
                
                # nx, ny가 범위 벗어나면 여기로 오겟지..?
                break
            result = max(result, total)
print(result)